
#4) Увести з клавіатури дійсні числа х і у, не рівні одне одному. Менше з цих двох чисел замінити половиною їх суми, а більше - їх подвоєним добутком.
def replace_numbers():

    x = float(input("Введіть число x: "))
    y = float(input("Введіть число y: "))

    if x == y:
        print("Числа не можуть бути рівні одне одному.")
        return

    if x < y:
        x = (x + y) / 2
        y = 2 * x
    else:
        y = (x + y) / 2
        x = 2 * y

    print("Результат заміни:")
    print("x =", x)
    print("y =", y)

replace_numbers()