
#3) Увести з клавіатури величини двох кутів трикутника (в градусах). Визначити, чи існує такий трикутник, і якщо так, то чи буде він прямокутним.
def triangle_type():

    angle1 = float(input("Введіть перший кут трикутника (в градусах): "))
    angle2 = float(input("Введіть другий кут трикутника (в градусах): "))

    if angle1 <= 0 or angle2 <= 0 or angle1 + angle2 >= 180:
        print("Такого трикутника не існує")
    else:
        print("Такий трикутник існує")

    if angle1 == 90 or angle2 == 90 or (180 - angle1 - angle2) == 90:
            print("Трикутник є прямокутним")
    else:
            print("Трикутник не є прямокутним")

triangle_type()
